doc/index.org
#+BIBLIOGRAPHY: bibliography ieee

#+LATEX_CLASS: scrreprt
#+LATEX_CLASS_OPTIONS: [10pt, openright, notitlepage]
#+LATEX_HEADER: \usepackage[a4paper, left=25mm, right=25mm, top=27mm, headheight=20mm, headsep=10mm, textheight=242mm, footskip=15mm]{geometry}
#+LATEX_HEADER: \usepackage[backend=biber, style=ieee]{biblatex}
#+LATEX_HEADER: \usepackage[dvipsnames]{xcolor}
#+LATEX_HEADER: % Definition of colors
#+LATEX_HEADER: %---------------------------------------------------------------------------
#+LATEX_HEADER: \RequirePackage{color}
#+LATEX_HEADER: \definecolor{linkblue}{rgb}{0,0,0.8}       % Standard
#+LATEX_HEADER: \definecolor{darkblue}{rgb}{0,0.08,0.45}   % Dark blue
#+LATEX_HEADER: \definecolor{bfhgrey}{rgb}{0.41,0.49,0.57} % BFH grey
#+LATEX_HEADER: \definecolor{linkcolor}{rgb}{0,0,0}
#+LATEX_HEADER: \colorlet{Black}{black}
#+LATEX_HEADER: \definecolor{keywords}{rgb}{255,0,0}
#+LATEX_HEADER: \definecolor{red}{rgb}{0.6,0,0}
#+LATEX_HEADER: \definecolor{green}{rgb}{0,0.5,0}
#+LATEX_HEADER: \definecolor{blue}{rgb}{0,0,0.5}
#+LATEX_HEADER: % Syntax colors
#+LATEX_HEADER: \definecolor{syntaxRed}{rgb}{0.6,0,0}
#+LATEX_HEADER: \definecolor{syntaxBlue}{rgb}{0,0,0.5}
#+LATEX_HEADER: \definecolor{syntaxComment}{rgb}{0,0.5,0}
#+LATEX_HEADER: % Background colors
#+LATEX_HEADER: \definecolor{syntaxBackground}{rgb}{0.95, 0.95, 0.95}
#+LATEX_HEADER: %---------------------------------------------------------------------------
#+LATEX_HEADER: \usepackage{tcolorbox}
#+LATEX_HEADER: \usepackage{pgfgantt}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \restylefloat{listing}
#+LATEX_HEADER: \tcbuselibrary{minted,skins}
#+LATEX_HEADER: \definecolor{bashcodebg}{rgb}{0.85,0.85,0.85}
#+LATEX_HEADER: \addbibresource{bibliography.bib}
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+LATEX_HEADER_EXTRA:
#+LATEX_COMPILER: pdflatex

#+TITLE: QDE --- A visual animation system.
#+SUBTITLE: MTE-7103: Master-Thesis
#+AUTHOR: Sven Osterwalder
#+EMAIL: sven.osterwalder@students.bfh.ch
#+DATE: February 20, 2017
#+OPTIONS: author:t date:t email:t ^:nil

* TODO Introduction

[Introduction here].

* TODO Administrative aspects

[Administrative aspects].

* TODO Scope

[Scope]

* TODO Procedure

- Literate programming
- Agile

** Project schedule
\begin{figure}[H]
    \begin{ganttchart}[
        vgrid,
        x unit=0.4cm,
        bar/.append style={fill=bfhgrey!50},
    ]{1}{25}
        \gantttitle{2017}{25} \ganttnewline{}
        \gantttitlelist{8,...,32}{1} \ganttnewline{} % chktex 11: Disable "you should use \ldots to achieve.."
        \ganttbar{Projektstart}{1}{1} \ganttnewline{}
        \ganttlinkedbar{Anforderungen}{2}{3} \ganttnewline{}
        \ganttlinkedbar{Erstellung Prototyp}{4}{10} \ganttnewline{}
        \ganttlinkedbar{Dokumentation}{14}{23} \ganttnewline{}
        \ganttlinkedbar{Korrekturen}{23}{24} \ganttnewline{}
        \ganttlinkedmilestone{Abgabe Dokumentation}{24} \ganttnewline{}
        \ganttbar{Erstellung Prototyp}{23}{23} \ganttnewline{}
        \ganttbar{Vorbereitung Präsentation/Verteidigung}{24}{25} \ganttnewline{}
        \ganttmilestone{Präsentation/Verteidigung}{25}
    \end{ganttchart}
    \caption{Zeitplan; Der Titel stellt Jahreszahlen, der Untertitel
    Kalenderwochen dar}\label{fig:timeschedule}
\end{figure}

* TODO Implementation

Die Umsetzung des Projektes findet mittels Literate Programming statt.
Der Programmcode wird von Grund auf direkt aus dieser Dokumentation erzeugt.

Den Aufbau betreffend, wird erst die Funktionalität erklärt, dann wird die
Funktionalität implementiert. (Unit-) Testfälle werden getrennt von dieser
Dokumentation verfasst und befinden sich im Anhang unter 
*************** TODO Insert reference/link to test cases here.
*************** END
.

Voraussetzungen, um den Programmcode direkt aus dieser Dokumentation zu
erstellen, sind zum aktuellen Zeitpunkt die folgenden:

- Ein Unix-Derivat als Betriebssystem (Linux, macOS)
- Python in der Version 3.5.x oder höher[fn:1]
- Pyenv[fn:2]
- Pyenv-virtualenv[fn:3]

Als erster Schritt wird eine passende Version von Python für virtualenv
installiert. Die verfügbaren Versionen lassen sich wie folgt anzeigen.

#+ATTR_LaTeX: :options fontsize=\footnotesize,linenos,bgcolor=bashcodebg
#+CAPTION:    Anzeige der verfügbaren Python-Versionen für Pyenv.
#+NAME:       fig:impl-pyenv-list
#+BEGIN_SRC bash :results output silent
pyenv install --list
#+END_SRC

Die gewünschte Version wird wie folgt installiert. In diesem Beispiel handelt es
sich um Version 3.6.0.

#+ATTR_LaTeX: :options fontsize=\footnotesize,linenos,bgcolor=bashcodebg
#+CAPTION:    Installation von Python in der Version 3.6.0 für Pyenv.
#+NAME:       fig:impl-pyenv-install
#+BEGIN_SRC bash :dir ../.
install 3.6.0
#+END_SRC

Es empfiehlt sich für das Projekt eine eigene, virtuelle Umgebung für Python zu
erstellen. Darin werden alle Abhängigkeiten installiert und somit werden
die Python-Pakete des Betriebsystem nicht kompromitiert. Es wird zuerst die
gewünschte (und zuvor installierte) Version, dann der gewünschte Name der
virtuellen Umgebung angegeben.

#+ATTR_LaTeX: :options fontsize=\footnotesize,linenos,bgcolor=bashcodebg
#+CAPTION:    Erstellung einer virtuellen Python-Umgebung mit Python Version 3.6.0.
#+NAME:       fig:impl-pyenv-venv
#+BEGIN_SRC bash :dir ../.
pyenv virtualenv 3.6.0 qde
#+END_SRC

Nun können die benötigten Abhängigkeiten für das Projekt problemlos installiert
werden. Diese befinden sich in der Datei =python_requirements.txt= und werden
mittels =pip= installiert.

#+ATTR_LaTeX: :options fontsize=\footnotesize,linenos,bgcolor=bashcodebg
#+CAPTION:    Installation der benötigten Abhängigkeiten des Projektes.
#+NAME:       fig:impl-pip-install
#+BEGIN_SRC bash :dir ../.
pip install -r python_requirements.txt
#+END_SRC

Somit sind nun alle Voraussetzungen erfüllt und die eigentliche Umsetzung kann
beginnen.

Der gesamte Programmcode soll im Verzeichnis =src= unterhalb des
Hauptverzeichnisses liegen.

#+ATTR_LaTeX: :options fontsize=\footnotesize,linenos,bgcolor=bashcodebg
#+CAPTION:    Erstellung des /src/-Unterverzeichnisses.
#+NAME:       fig:impl-mkdir-src
#+BEGIN_SRC bash :dir ../.
  mkdir -p src
#+END_SRC

Um zu verhindern, dass mehrere Module denselben Namen verwenden, werden
Namespaces verwendet.[fn:8] Der Haupt-Namespace des Projektes soll =qde= lauten.

#+ATTR_LaTeX: :options fontsize=\footnotesize,linenos,bgcolor=bashcodebg
#+CAPTION:    Erstellung des =qde=-Namespaces.
#+NAME:       fig:impl-mkdir-qde
#+BEGIN_SRC bash :dir ../.
mkdir -p src/qde
#+END_SRC

In der ersten Phase des Projektes soll der Editor erstellt werden. Dieser dient
der Erstellung und Verwaltung von Echtzeit-Animationen \cite[S. 29]{osterwalder_qde_2016}.

