doc/index.tex
% Created 2017-02-28 Tue 16:58
% Intended LaTeX compiler: pdflatex
\documentclass[10pt, openright, notitlepage]{scrreprt}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[a4paper, left=25mm, right=25mm, top=27mm, headheight=20mm, headsep=10mm, textheight=242mm, footskip=15mm]{geometry}
\usepackage[backend=biber, style=ieee]{biblatex}
\usepackage[dvipsnames]{xcolor}
% Definition of colors
%---------------------------------------------------------------------------
\RequirePackage{color}
\definecolor{linkblue}{rgb}{0,0,0.8}       % Standard
\definecolor{darkblue}{rgb}{0,0.08,0.45}   % Dark blue
\definecolor{bfhgrey}{rgb}{0.41,0.49,0.57} % BFH grey
\definecolor{linkcolor}{rgb}{0,0,0}
\colorlet{Black}{black}
\definecolor{keywords}{rgb}{255,0,0}
\definecolor{red}{rgb}{0.6,0,0}
\definecolor{green}{rgb}{0,0.5,0}
\definecolor{blue}{rgb}{0,0,0.5}
% Syntax colors
\definecolor{syntaxRed}{rgb}{0.6,0,0}
\definecolor{syntaxBlue}{rgb}{0,0,0.5}
\definecolor{syntaxComment}{rgb}{0,0.5,0}
% Background colors
\definecolor{syntaxBackground}{rgb}{0.95, 0.95, 0.95}
%---------------------------------------------------------------------------
\usepackage{tcolorbox}
\usepackage{pgfgantt}
\usepackage{float}
\restylefloat{listing}
\tcbuselibrary{minted,skins}
\definecolor{bashcodebg}{rgb}{0.85,0.85,0.85}
\addbibresource{bibliography.bib}
\author{Sven Osterwalder\thanks{sven.osterwalder@students.bfh.ch}}
\date{February 20, 2017}
\title{QDE --- A visual animation system.\\\medskip
\large MTE-7103: Master-Thesis}
\hypersetup{
 pdfauthor={Sven Osterwalder},
 pdftitle={QDE --- A visual animation system.},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\chapter{{\bfseries\sffamily TODO} Introduction}
\label{sec:org780c5e7}

[Introduction here].

\chapter{{\bfseries\sffamily TODO} Administrative aspects}
\label{sec:org9790706}

[Administrative aspects].

\chapter{{\bfseries\sffamily TODO} Scope}
\label{sec:orgdf9a84f}

[Scope]

\chapter{{\bfseries\sffamily TODO} Procedure}
\label{sec:org5dc2502}

\begin{itemize}
\item Literate programming
\item Agile
\end{itemize}

\section{Project schedule}
\label{sec:org22276dc}
\begin{figure}[H]
    \begin{ganttchart}[
        vgrid,
        x unit=0.4cm,
        bar/.append style={fill=bfhgrey!50},
    ]{1}{25}
        \gantttitle{2017}{25} \ganttnewline{}
        \gantttitlelist{8,...,32}{1} \ganttnewline{} % chktex 11: Disable "you should use \ldots to achieve.."
        \ganttbar{Projektstart}{1}{1} \ganttnewline{}
        \ganttlinkedbar{Anforderungen}{2}{3} \ganttnewline{}
        \ganttlinkedbar{Erstellung Prototyp}{4}{10} \ganttnewline{}
        \ganttlinkedbar{Dokumentation}{14}{23} \ganttnewline{}
        \ganttlinkedbar{Korrekturen}{23}{24} \ganttnewline{}
        \ganttlinkedmilestone{Abgabe Dokumentation}{24} \ganttnewline{}
        \ganttbar{Erstellung Prototyp}{23}{23} \ganttnewline{}
        \ganttbar{Vorbereitung Präsentation/Verteidigung}{24}{25} \ganttnewline{}
        \ganttmilestone{Präsentation/Verteidigung}{25}
    \end{ganttchart}
    \caption{Zeitplan; Der Titel stellt Jahreszahlen, der Untertitel
    Kalenderwochen dar}\label{fig:timeschedule}
\end{figure}

\chapter{{\bfseries\sffamily TODO} Implementation}
\label{sec:org756301f}

Die Umsetzung des Projektes findet mittels Literate Programming statt.
Der Programmcode wird von Grund auf direkt aus dieser Dokumentation erzeugt.

Den Aufbau betreffend, wird erst die Funktionalität erklärt, dann wird die
Funktionalität implementiert. (Unit-) Testfälle werden getrennt von dieser
Dokumentation verfasst und befinden sich im Anhang unter 
\begin{center}
\fbox{
\begin{minipage}[c]{.6\textwidth}
\textbf{\textsf{\textsc{TODO}}} Insert reference/link to test cases here.

\end{minipage}
}
\end{center}
.

Voraussetzungen, um den Programmcode direkt aus dieser Dokumentation zu
erstellen, sind zum aktuellen Zeitpunkt die folgenden:

\begin{itemize}
\item Ein Unix-Derivat als Betriebssystem (Linux, macOS)
\item Python in der Version 3.5.x oder höher\footnote{\url{https://www.python.org}}
\item Pyenv\footnote{\url{https://github.com/yyuu/pyenv}}
\item Pyenv-virtualenv\footnote{\url{https://github.com/yyuu/pyenv-virtualenv}}
\end{itemize}

Als erster Schritt wird eine passende Version von Python für virtualenv
installiert. Die verfügbaren Versionen lassen sich wie folgt anzeigen.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
pyenv install --list
\end{minted}
\caption{\label{org9795c64}
Anzeige der verfügbaren Python-Versionen für Pyenv.}
\end{listing}

Die gewünschte Version wird wie folgt installiert. In diesem Beispiel handelt es
sich um Version 3.6.0.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
install 3.6.0
\end{minted}
\caption{\label{org472a03d}
Installation von Python in der Version 3.6.0 für Pyenv.}
\end{listing}

Es empfiehlt sich für das Projekt eine eigene, virtuelle Umgebung für Python zu
erstellen. Darin werden alle Abhängigkeiten installiert und somit werden
die Python-Pakete des Betriebsystem nicht kompromitiert. Es wird zuerst die
gewünschte (und zuvor installierte) Version, dann der gewünschte Name der
virtuellen Umgebung angegeben.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
pyenv virtualenv 3.6.0 qde
\end{minted}
\caption{\label{org87cd85f}
Erstellung einer virtuellen Python-Umgebung mit Python Version 3.6.0.}
\end{listing}

Nun können die benötigten Abhängigkeiten für das Projekt problemlos installiert
werden. Diese befinden sich in der Datei \texttt{python\_requirements.txt} und werden
mittels \texttt{pip} installiert.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
pip install -r python_requirements.txt
\end{minted}
\caption{\label{orgd7beb0a}
Installation der benötigten Abhängigkeiten des Projektes.}
\end{listing}

Somit sind nun alle Voraussetzungen erfüllt und die eigentliche Umsetzung kann
beginnen.

Der gesamte Programmcode soll im Verzeichnis \texttt{src} unterhalb des
Hauptverzeichnisses liegen.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
mkdir -p src
\end{minted}
\caption{\label{orge0b3285}
Erstellung des \emph{src}-Unterverzeichnisses.}
\end{listing}

Um zu verhindern, dass mehrere Module denselben Namen verwenden, werden
Namespaces verwendet.\footnote{\url{https://docs.python.org/3/tutorial/classes.html\#python-scopes-and-namespaces}} Der Haupt-Namespace des Projektes soll \texttt{qde} lauten.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
mkdir -p src/qde
\end{minted}
\caption{\label{org2076295}
Erstellung des \texttt{qde}-Namespaces.}
\end{listing}

In der ersten Phase des Projektes soll der Editor erstellt werden. Dieser dient
der Erstellung und Verwaltung von Echtzeit-Animationen \cite[S. 29]{osterwalder_qde_2016}.
