doc/index.tex

\section{Editor}
\label{sec:orgbd196cd}

Der Editor soll sich im Verzeichnis \texttt{editor} unterhalb des \texttt{src/qde}-Verzeichnisses
befinden.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
mkdir -p src/qde/editor
\end{minted}
\caption{\label{org414c284}
Erstellung des \texttt{editor}-Namespaces.}
\end{listing}

Um sicherzustellen, dass Module als solche verwendet werden können, muss pro
Modul und Namespace eine Datei zur Initialisierung vorhanden sein. Es handelt sich
dabei um Dateien namens \texttt{\_\_init\_\_.py}, welche im minimalen Fall leer sind. Diese
können aber auch regulären Programmcode, wie zum Beispiel Klassen oder Methoden
enthalten.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
touch src/qde/__init__.py
touch src/qde/editor/__init__.py
\end{minted}
\caption{\label{orgfedb1e7}
Erstellung des \texttt{qde}-Namespaces und des \texttt{editor}-Namespaces.}
\end{listing}

Im weiteren Verlauf des Dokumentes wird darauf verzichtet diese Dateien explizit
zu erwähnen, sie werden direkt in den entsprechenden Codeblöcken erstellt und
als gegeben angesehen.

Nun kann mit der eigentlichen Erstellung des Editors begonnen werden. Wie unter
\label{org4593466} beschrieben, werden für alle Funktionalitäten erst (Unit-) Tests
verfasst und erst dann die eigentliche Funktionalität umgesetzt.

Der Einstiegspunkt einer Qt-Applikation mit grafischer Oberfläche ist die Klasse
\texttt{QtApplication}. Gemäss \footnote{\url{http://doc.qt.io/Qt-5/qapplication.html}} kann die Klasse direkt instanziert und benutzt
werden, es ist unter Umständen jedoch sinnvoller die Klasse zu kapseln, was
schlussendlich eine höhere Flexibilität bei der Umsetzung bietet. Es soll daher
die Klasse \texttt{Application} erstellt werden, welche diese Abstraktion bietet.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
mkdir -p src/qde/editor/application
touch src/qde/editor/application/__init__.py
\end{minted}
\caption{\label{orgab9f768}
Erstellung des \texttt{application}-Namespaces.}
\end{listing}

Zunächst wird jedoch der entsprechende Unit-Test definiert. Dieser instanziert
die Klasse und stellt sicher, dass sie ordnungsgemäss gestartet werden kann.

Als erster Schritt wird der Header des Test-Modules definiert.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# -*- coding: utf-8 -*-

"""Module for testing QDE class."""
\end{minted}
\caption{\label{org0a773af}
Header des Test-Modules, \texttt{<<test-app-header>>}.}
\end{listing}

Dann werden die benötigen Module importiert. Es sind dies das System-Modul
\emph{sys} und das Modul \emph{application}, bei welchem es sich um die Applikation
selbst handelt. Das System-Modul \emph{sys} wird benötigt um der Applikation ggf.
Start-Argumente mitzugeben, also zum Beispiel:

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
python main.py argument1 argument2
\end{minted}
\caption{\label{orge386b83}
Aufruf des Main-Modules mit zwei Argumenten, \texttt{argument1} und \texttt{argument2}.}
\end{listing}

Der Einfachheit halber werden die Importe in zwei Kategorien unterteilt: Importe
von Pyhton-eigenen Modulen und Importe von selbst verfassten Modulen.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
<<test-app-system-imports>>

<<test-app-project-imports>>
\end{minted}
\caption{\label{orgd0c4720}
Definition der Importe für das Modul zum Testen der Applikation.}
\end{listing}

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# System imports
import sys
\end{minted}
\caption{\label{orgc47d531}
Importe von Python-eigenen Modulen im Modul zum Testen der Applikation.}
\end{listing}

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# Project imports
from qde.editor.application import application
\end{minted}
\caption{\label{org3328d5d}
Importe von selbst verfassten Modulen im Modul zum Testen der Applikation.}
\end{listing}

Somit kann schliesslich getestet werden, ob die Applikation startet, indem diese
instanziert wird und die gesetzten Namen geprüft werden.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
def test_constructor():
    """Test if the QDE application is starting up properly."""
    app = application.QDE(sys.argv)
    assert app.applicationName() == "QDE"
    assert app.applicationDisplayName() == "QDE"
\end{minted}
\caption{\label{org9c90a6f}
Methode zum Testen des Konstruktors der Applikation.}
\end{listing}

Finally, one can merge the above defined elements to an executable test-module,
containing the header, the imports and the test cases (which is in this case
only a test case for testing the constructor).

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
<<test-app-header>>

<<test-app-imports>>

<<test-app-test-constructor>>
\end{minted}
\caption{Modul zum Testen der Applikation.}
\end{listing}

Führt man die Testfälle nun aus, schlagen diese erwartungsgemäss fehl, da die
Klasse, und somit die Applikation, als solche noch nicht existiert. Zum jetzigen
Zeitpunkt kann noch nicht einmal das Modul importiert werden, da diese noch
nicht existiert.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
python -m pytest qde/editor/application/test_application.py
\end{minted}
\caption{Aufruf zum Testen des Applkations-Modules.}
\end{listing}

An dieser Stelle macht es Sinn, sich zu überlegen, welche Funktionalität die
Applikation selbst haben soll. Es ist nicht nötig selbst einen Event-Loop zu
implementieren, da ein solcher bereits durch Qt vorhanden ist.\footnote{\url{http://doc.qt.io/Qt-5/qapplication.html\#exec}}

Die Applikation hat die Aufgabe die Kernelemente der Applikation zu
initialisieren. So fungiert das Modul als Knotenpunkt zwischen den
verschiedenen Ebenen der Architektur, indem es diese mittels Signalen
verbindet.\cite[S. 37 bis 38]{osterwalder_qde_2016}

Weiter soll es nützliche Schnittstellen, wie zum Beispiel das Protokollieren
von Meldungen, bereitstellen. Und schliesslich soll das Modul eine Möglichkeit
bieten beim Verlassen der Applikation zusätzliche Aufgaben, wie etwa das
Entfernen von temporären Dateien, zu bieten.

Da es sehr nützlich ist, den Zustand einer Applikation jederzeit in Form von
gezielten Ausgaben nachvollziehen zu können, bietet es sich an als ersten
Schritt ein Modul zur Protokollierung zu implementieren.
Protokollierung ist ein sehr zentrales Element, daher wird das Modul im
Namespace \texttt{foundation} erstellt.

Die (Datei-) Struktur zur Erstellung und Benennung der Module erfolgt ab diesem
Zeitpunkt nach dem Schichten-Modell gemäss \cite[S. 40]{osterwalder_qde_2016}.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
mkdir -p src/qde/editor/foundation
touch src/qde/editor/foundation/__init__.py
\end{minted}
\caption{\label{orgb1158ab}
Erstellung und Initialisierung des \texttt{foundation}-Namespaces.}
\end{listing}

Die Protokollierung auf Klassen-Basis stattfinden. Vorerst sollen
Protokollierungen als Stream ausgegeben werden. Pro Klasse muss also eine
\texttt{logging}-Instanz instanziert und mit dem entsprechenden Handler ausgestattet
werden. Um den Programmcode nicht unnötig wiederholen zu müssen, bietet sich
hierfür das Decorator-Pattern von Python an\footnote{\url{https://www.python.org/dev/peps/pep-0318/}}.

Die Klasse zur Protokollierung soll also Folgendes tun:

\begin{itemize}
\item Einen Logger-Namen auf Basis des aktuellen Moduls und der aktuellen Klasse setzen
\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
logger_name = "%s.%s" % (cls.__module__, cls.__name__)
\end{minted}
\caption{\label{org16a7d85}
Setzen des Logger-Names auf Basis des aktuellen Modules und Klasse.}
\end{listing}

\item Einen Stream-Handler nutzen
\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
stream_handler = logging.StreamHandler()
\end{minted}
\caption{\label{org701ba1e}
Initialisieren eines Stream-Handlers.}
\end{listing}

\item Die Stufe der Protokollierung abhängig von der aktuellen Konfiguration setzen
\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# TODO: Do this according to config.
stream_handler.setLevel(logging.DEBUG)
\end{minted}
\caption{\label{orgffe05ce}
Setzen des \texttt{DEBUG} Log-Levels.}
\end{listing}

\item Protokoll-Einträge ansprechend formatieren
\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# TODO: Set up formatter in debug mode only
formatter = logging.Formatter("%(asctime)s - %(levelname)-7s - %(name)s.%(funcName)s::%(lineno)s: %(message)s")
stream_handler.setFormatter(formatter)
\end{minted}
\caption{\label{orgd93397b}
Anpassung der Ausgabe von Protokoll-Meldungen.}
\end{listing}

\item Eine einfache Schnittstelle zur Protokollierung bieten
\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
cls.logger = logging.getLogger(logger_name)
cls.logger.propagate = False
cls.logger.addHandler(stream_handler)

return cls
\end{minted}
\caption{\label{org0515601}
Nutzung des erstellten Stream-Handlers und Rückgabe der Klasse.}
\end{listing}
\end{itemize}

Auch hierfür werden wiederum zuerst die Testfälle verfasst.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# -*- coding: utf-8 -*-

"""Module for testing common methods class."""

# System imports
import logging

# Project imports
from qde.editor.foundation import common


@common.with_logger
class FooClass(object):
    """Dummy class for testing the logging decorator."""

    def __init__(self):
        """Constructor."""
        pass

def test_with_logger():
    """Test if the @with_logger decorator works correctly."""

    foo_instance = FooClass()
    logger = foo_instance.logger
    name = "qde.editor.foundation.test_common.FooClass"
    assert logger is not None
    assert len(logger.handlers) == 1
    handler = logger.handlers[0]
    assert type(handler) == logging.StreamHandler
    assert logger.propagate == False
    assert logger.name == name
\end{minted}
\caption{\label{org2e5ec0d}
Testfälle der Hilfsmethode zur Protokollierung.}
\end{listing}

\begin{minted}[]{bash}
python -m pytest qde/editor/foundation/test_common.py
\end{minted}

Nun kann die eigentliche Funktionalität implementiert werden.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# -*- coding: utf-8 -*-

"""Module holding common helper methods."""

# System imports
import logging


def with_logger(cls):
    """Add a logger instance (using a steam handler) to the given class
    instance.

    :param cls: the class which the logger shall be added to
    :type  cls: a class of type cls

    :return: the class type with the logger instance added
    :rtype:  a class of type cls
    """

    <<logger-name>>
    <<logger-stream-handler>>
    <<logger-set-level>>
    <<logger-set-formatter>>
    <<logger-return-logger>>
\end{minted}
\caption{\label{org0ebe6ad}
Das \texttt{common}-Modul und eine Methode zur Protokollierung in Klassen.}
\end{listing}

Führt man nun die Testfälle erneut aus, so schlagen diese nicht mehr fehl.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
python -m pytest qde/editor/foundation/test_common.py
\end{minted}
\caption{Ausführen der Testfälle für das \texttt{common}-Modul.}
\end{listing}

Der Decorator kann nun direkt auf die Klasse der QDE-Applikation angewendet
werden.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
@common.with_logger
class QDE(QApplication):
  """Main application for QDE."""

  <<app-class-body>>
\end{minted}
\caption{\label{org598e769}
Definition der Klasse \texttt{Application} mit dem \texttt{with\_logger}-Dekorator des \texttt{common}-Modules.}
\end{listing}

Damit die Protokollierung jedoch nicht nur via STDOUT in der Konsole statt
findet, muss diese entsprechend konfiguriert werden. Das \emph{logging}-Modul von
Python bietet hierzu vielfältige Möglichkeiten.\footnote{\url{https://docs.python.org/3/library/logging.html}} So kann die
Protokollierung mittels der ``Configuration API'' konfiguriert werden. Hier
bietet sich die Konfiguration via Dictionary an. Ein Dictionary kann zum
Beispiel sehr einfach aus einer JSON-Datei generiert werden.

Die Haupt-Applikation soll die Protokollierung folgendermassen vornehmen:
\begin{itemize}
\item Die Konfiguration erfolgt entweder via externer JSON-Datei oder verwendet die
Standardkonfiguration, welche von Python mittels \texttt{basicConfig} vorgegeben
wird.
\item Als Name für die JSON-Datei wird \texttt{logging.json} angenommen.
\item Ist in den Umgebungsvariablen des Betriebssystems die Variable \emph{LOG\_CFG}
gesetzt, wird diese als Pfad für die JSON-Datei angenommen. Ansonsten wird
angenommen, dass sich die Datei \texttt{logging.json} im Hauptverzeichnis befindet.
\item Existiert die JSON-Konfigurationsdatei nicht, wird auf die
Standardkonfiguration zurückgegeriffen.
\item Die Protokollierung verwendet immer eine Protokollierungsstufe (Log-Level)
zum Filtern der verschiedenen Protokollnachrichten.
\end{itemize}

Die Haupt-Applikation nimmt also die Parameter \texttt{Pfad}, \texttt{Protokollierungsstufe}
sowie \texttt{Umgebungsvariable} entgegen.

Um sicherzustellen, dass die Protokollierung wie gewünscht funktioniert, wird
diese durch die entsprechenden Testfälle abgedeckt.

Der einfachste Testfall ist die Standardkonfiguration, also ein Aufruf ohne
Parameter.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
def test_setup_logging_without_arguments():
    """Test logging of QDE application without arguments."""
    app = application.QDE(sys.argv)
    root_logger = logging.root
    handlers = root_logger.handlers
    assert len(handlers) == 1
    handler = handlers[0]
\end{minted}
\caption{\label{orgf9e80f4}
Testfall 1 der Protkollierung der Hauptapplikation: Aufruf ohne Argumente.}
\end{listing}

Da obige Testfälle das \emph{logging}-Module benötigen, muss das Importieren der Module
entsprechend erweitert werden.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
import logging
\end{minted}
\caption{\label{orgd8c9d30}
Erweiterung des Importes von System-Modulen im Modul zum Testen der Applikation.}
\end{listing}

Und der Testfall muss den Testfällen hinzugefügt werden.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
<<test-app-test-logging-default>>
\end{minted}
\caption{\label{org50588ff}
Hinzufügen des Testfalles 1 zu den bestehenden Testfällen im Modul zum Testen der Applikation.}
\end{listing}

Nun kann die eigentliche Umsetzung zur Konfiguration der Protokollierung
umgesetzt und der Klasse hinzugefügt werden.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
def setup_logging(self,
    default_path='logging.json',
    default_level=logging.INFO,
    env_key='LOG_CFG'
):
    """Setup logging configuration"""

    path = default_path
    value = os.getenv(env_key, None)

    if value:
        path = value

    if os.path.exists(path):
        with open(path, 'rt') as f:

            config = json.load(f)
            logging.config.dictConfig(config)
    else:
        logging.basicConfig(level=default_level)
\end{minted}
\caption{\label{orge44e6fc}
Methode zum Initialisieren der Protokollierung der Applikation.}
\end{listing}


\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# -*- coding: utf-8 -*-

"""Main application module for QDE."""

<<app-imports>>

<<app-class-definition>>
\end{minted}
\caption{Haupt-Modul und Einstiegspunkt der Applikation.}
\end{listing}

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
<<app-system-imports>>

<<app-project-imports>>
\end{minted}
\caption{\label{orgf9a0a9c}
Definition der Importe des Haupt-Modules.}
\end{listing}

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# System imports
from   PyQt5.Qt import QApplication
from   PyQt5.Qt import QIcon
import logging
import os
\end{minted}
\caption{\label{org64b0c17}
Importe von Python-eigenen Modulen im Haupt-Modul.}
\end{listing}

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
# Project imports
from qde.editor.foundation import common
\end{minted}
\caption{\label{org47e7c52}
Importe von selbst verfassten Modulen im Haupt-Modul.}
\end{listing}

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
def __init__(self, arguments):
    """Constructor.

    :param arguments: a (variable) list of arguments, that are
                      passed when calling this class.
    :type  argv:      list
    """

    super(QDE, self).__init__(arguments)
    self.setWindowIcon(QIcon("assets/icons/im.png"))
    self.setApplicationName("QDE")
    self.setApplicationDisplayName("QDE")

    self.setup_logging()
\end{minted}
\caption{\label{org74f93fc}
Konstruktor des Haupt-Modules.}
\end{listing}

Der Konstruktor und die Methode zum Einrichten der Protokollierung werden
schliesslich der Klasse hinzugefügt.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{python}
<<app-constructor>>

<<app-setup-logging>>
\end{minted}
\caption{\label{org017e569}
Hinzufügen des Konstruktors sowie der Methode zum Einrichten der Protokollierung zum Körper des Haupt-Modules.}
\end{listing}

Somit ist es nun möglich die Testfälle der Applikation auszuführen.

\begin{listing}[H]
\begin{minted}[,fontsize=\footnotesize,linenos,bgcolor=bashcodebg]{bash}
python -m pytest qde/editor/application/test_application.py
\end{minted}
\caption{Ausführen der Testfälle für das Haupt-Modul.}
\end{listing}
