doc/index.tex

\chapter{Worklog}
\label{sec:orgc620b9b}

\textit{<2017-02-20 Mon> } Initiale Struktur des Dokumentes

\chapter{Bibliography}
\label{sec:org3ec2262}

\printbibliography{}

\chapter{Appendix}
\label{sec:orgb9f659c}

\section{Meeting minutes}
\label{sec:org4d9a7ad}

\subsection{Meeting mintutes 2017-02-23}
\label{sec:org67f788d}

\begin{center}
\begin{tabular}{ll}
No.: & 01\\
Date: & 2017-02-23 13:00 - 13:30\\
Place: & Cafeteria, Main building, Berne University of applied sciences, Biel\\
Involved persons: & Prof. Claude Fuhrer (CF)\\
 & Sven Osterwalder (SO)\\
\end{tabular}
\end{center}

Kick-off meeting for the thesis.

\begin{enumerate}
\item Presentation and discussion of the current state of work
\label{sec:org7971ca8}

\begin{itemize}
\item Presentation of the workflow. Emacs and Org-Mode is used to write the
documentation as well as the actual code. (SO)
\begin{itemize}
\item This is a very interesting approach. The question remains if the effort of
this method does not prevail the method of developing the application and
the documentation in parallel. It is important to reach a certain state of
the application. Also the report should not exceed around 80 pages. (CF)
\begin{itemize}
\item A decision about the used method is made until the end of this week. (SO)
\end{itemize}
\end{itemize}
\item The code will unit-tested using py.test and / or hypothesis. (SO)
\item Presentation of the structure of the documentation. It follows the schematics
of the preceding documentations. (SO)
\end{itemize}

\item Further steps / proceedings
\label{sec:orgdf59fe7}

\begin{itemize}
\item The expert of the thesis, Mr. Dubuis, puts mainly emphasis on the
documentation. The code of the thesis is respected too, but is clearly not the
main aspect. (CF)
\item Mr. Dubuis also puts emphasis on code metrics. Therefore the code needs to be
(automatically) tested and a coverage of at least 60 to 70 percent must be
reached. (CF)
\item A meeting with Mr. Dubuis shall be scheduled at the end of March or beginning
of April 2017. (CF)
\item The administrative aspects as well as the scope should be written until end of
March 2017 for being able to present them to Mr. Dubuis. (CF)
\item Mr. Dubuis should be asked if the publicly available access to the whole
thesis is enough or if he wishes to receive the particular status right before
the meetings. (CF)
\item Regularly meetings will be held, but the frequency is to be defined yet.
Further information follows per e-mail. (CF)
\item At the beginning of the studies, a workplace at the Berne University of
applied sciences in Biel was offered. Is this possibility still available?
(SO)
\begin{itemize}
\item Yes, that possibility is still available and details will be clarified and
follow per e-mail. (CF)
\end{itemize}
\end{itemize}

\item To do for the next meeting
\label{sec:orgb5ca7af}

\begin{enumerate}
\item {\bfseries\sffamily TODO} Create GitHub repository for the thesis. (SO)
\label{sec:orge240175}

\begin{enumerate}
\item {\bfseries\sffamily TODO} Inform Mr. Fuhrer about the creation of the repository. (SO)
\label{sec:orged71244}
\end{enumerate}

\item {\bfseries\sffamily TODO} Ask Mr. Dubuis by mail how he wants to receive the documentation. (SO)
\label{sec:org3caae0d}

\item {\bfseries\sffamily TODO} Set up appointments with Mr. Dubuis (CF)
\label{sec:orgffcc5cd}

\item {\bfseries\sffamily DONE} Clarify possibility of a workplace at Berne University of applied sciences in Biel. (CF)
\label{sec:org3f23689}
\begin{enumerate}
\item A workplace was found at the RISIS laboratory and may be used instantly. (CF)
\label{sec:org428bd32}
\end{enumerate}

\item {\bfseries\sffamily DONE} Decide about the method used for developing this thesis. (SO)
\label{sec:org3a9379f}
\begin{enumerate}
\item After discussions with a colleague the method of literate programming is
\label{sec:org532dbdb}
kept. The documentation containing the literate program will although be
attached as appendix as it most likely will exceed 80 pages. Instead the
method will be introduced in the report and the report will be endowed
with examples from the literate program.
\end{enumerate}
\end{enumerate}

\item Scheduling of the next meeting
\label{sec:org260b18a}

\begin{itemize}
\item To be defined
\end{itemize}
\end{enumerate}
\end{document}